# 20210428
# 해당 파일은 stata 로 작업하여 더미변수를 추가한 각 시점별 거래데이터( 예) 2020_4Q) 를
# Eviews 에서 편집하기 쉽도록 데이터 전처리 하는 코드이다.
# 우선 인덱스는 별도로 추가한 뒤 작업하였다.

######################################################################################################################
# import packages
import pandas as pd
import numpy as np

######################################################################################################################

df1 = pd.read_excel('seminar data/data/2017_2Q_data.xlsx', header=0, skipfooter=0)
df2 = pd.read_excel('seminar data/data/2020_4Q_data.xlsx', header=0, skipfooter=0)

# 회귀분석이 용이하도록 데이터를 작업해준다.
df_17_2Q = df1[['법정동', '아파트_y', '거래금액', 'log_price', '세대수', 'age', '주차대수_세대',
               '용적률', '건폐율', '전용면적(㎡)', '전용률(%)', '방 개수', '화장실 개수', '층',
               'D1', 'D2', 'D3', 'D4', 'D5', 'D6']]

df_20_4Q = df2[['법정동', '아파트_y', '거래금액', 'log_price', '세대수', 'AGE', '주차대수_세대',
               '용적률', '건폐율', '전용면적(㎡)', '전용률(%)', '방 개수', '화장실 개수', '층',
               'D1', 'D2', 'D3', 'D4', 'D5', 'D6']]

# 다시 엑셀파일로 전환
df_17_2Q.to_excel('seminar data/data/2017_2Q_data.xlsx')

df_20_4Q.to_excel('seminar data/data/2020_4Q_data.xlsx')